Autodesk.Revit.DB.BasicFileInfo.Extract(System.String)
Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path
file:
The full path to the file to be queried, including project (.rvt) and family (.rfa) files.
Returns:
If successful, basic file data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The file is a newer format file where the structure of the BasicFileInfo storage has changed, or the file is saved in very old version of Revit without basic file data.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.ClientAppName
Returns ClientAppName.
Since:
2021